# 寫程式 -> 程式邏輯
# 腦袋中的邏輯 -> 程式碼(實現手法)
# 編程思維

#資料結構
#

#演算法
#

#變數(Variables)
#什麼是變數?
#可以存放數值(數字、字串、物件...)的東西，一次只能存放一個東西
#如何使用變數?
x = 100 #"="不是代表等於(a=b),而是賦予它一個數值

#列表、串列(list)
#什麼是串列? 
x_list = [1,2,3,4,5]
#可以一次存放多的數值的東西


#字典(dict)
#什麼是字典? 
x_dict = {"ch":"國文","en":"英文","math":"數學"}
print(x_dict["ch"])
#存放有屬性的資料

#if else
#比較運算子、邏輯運算子
#and 如果兩者都為真，結果才會是真
#or 只要其中一人是真，結果就會是真

#for、while迴圈
#for: 可以幫我們把串列裡面的東西，一個一個的拿出來，執行的次數是串列的長度。
#     可以執行固定次數的程式碼!(看你的物件內容)
#while: 當在xxx情況時候，會執行該段程式碼(滿足某個條件下的時候執行)，執行次數通常不能確定是多少次。